tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jakehilborn/jakehilborn"
tap "nutcracker/tap"
tap "rbenv/tap"
brew "automake"
brew "bat"
brew "glib", link: false
brew "cmake"
brew "coreutils"
brew "curl"
brew "exa"
brew "fd"
brew "flux"
brew "gh"
brew "git"
brew "git-delta"
brew "tcl-tk"
brew "git-gui"
brew "gnupg"
brew "harfbuzz"
brew "jq"
brew "jupyterlab"
brew "krb5"
brew "lazygit"
brew "libpq"
brew "libpqxx"
brew "libsass"
brew "libtool"
brew "mkcert"
brew "neovim"
brew "nvm"
brew "openapi-generator"
brew "openjdk"
brew "openssl@3"
brew "postgresql@14", restart_service: true
brew "pyenv"
brew "python@3.9"
brew "rbenv"
brew "redis", restart_service: true
brew "ripgrep"
brew "stow"
brew "the_silver_searcher"
brew "tmux"
brew "wget"
brew "yarn"
brew "zlib"
brew "zsh"
brew "jakehilborn/jakehilborn/displayplacer"
cask "datagrip"
cask "dbeaver-community"
cask "docker"
cask "figma"
cask "font-3270-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-cousine-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-mplus-nerd-font"
cask "font-noto-nerd-font"
cask "font-open-dyslexic-nerd-font"
cask "font-overpass-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-victor-mono"
cask "font-victor-mono-nerd-font"
cask "insomnia"
cask "jetbrains-gateway"
cask "licecap"
cask "menumeters"
cask "microsoft-edge"
cask "microsoft-teams"
cask "notion"
cask "pycharm"
cask "rubymine"
cask "slack"
cask "visual-studio-code"
cask "webstorm"
cask "zoom"
vscode "aliariff.vscode-erb-beautify"
vscode "austenc.tailwind-docs"
vscode "bradlc.vscode-tailwindcss"
vscode "bung87.rails"
vscode "bung87.vscode-gemfile"
vscode "capaj.graphql-codegen-vscode"
vscode "castwide.solargraph"
vscode "CraigMaslowski.erb"
vscode "cweijan.vscode-database-client2"
vscode "dbaeumer.vscode-eslint"
vscode "elliotlarson.ruby-around-the-block"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "hjleochen.rails-nav"
vscode "hoovercj.ruby-linter"
vscode "Hridoy.rails-snippets"
vscode "IronGeek.vscode-env"
vscode "kaiwood.endwise"
vscode "karunamurti.haml"
vscode "karunamurti.rspec-snippets"
vscode "Kosai106.ruby-syntax-replacer"
vscode "MariusAlchimavicius.json-to-ts"
vscode "miguel-savignano.ruby-symbols"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.makefile-tools"
vscode "naumovs.color-highlight"
vscode "nrwl.angular-console"
vscode "orsenkucher.vscode-graphql"
vscode "quicktype.quicktype"
vscode "rebornix.ruby"
vscode "ricardo-emerson.ruby-on-rails-development-extensions-pack"
vscode "robert.ruby-snippet"
vscode "shaglock.ruby-extension-pack"
vscode "shanehofstetter.rails-open-partial"
vscode "sianglim.slim"
vscode "siliconsenthil.rufo-vscode"
vscode "tmikoss.rails-latest-migration"
vscode "vortizhe.simple-ruby-erb"
vscode "vscodevim.vim"
vscode "WakaTime.vscode-wakatime"
vscode "wingrunr21.vscode-ruby"
vscode "wix.vscode-import-cost"
vscode "ZneuRay.erb-vscode-snippets"
